jsqinyunzhen/stm32_demo_rtxos/mqtt_app/transport.c
/*******************************************************************************
 * Copyright (c) 2014 IBM Corp.
 *
 * All rights reserved. This program and the accompanying materials
 * are made available under the terms of the Eclipse Public License v1.0
 * and Eclipse Distribution License v1.0 which accompany this distribution.
 *
 * The Eclipse Public License is available at
 *    http://www.eclipse.org/legal/epl-v10.html
 * and the Eclipse Distribution License is available at
 *   http://www.eclipse.org/org/documents/edl-v10.php.
 *
 * Contributors:
 *    Ian Craggs - initial API and implementation and/or initial documentation
 *    Sergio R. Caprile - "commonalization" from prior samples and/or documentation extension
 *******************************************************************************/


/**
This simple low-level implementation assumes a single connection for a single thread. Thus, a static
variable is used for that connection.
On other scenarios, the user must solve this by taking into account that the current implementation of
MQTTPacket_read() has a function pointer for a function call to get the data to a buffer, but no provisions
to know the caller or other indicator (the socket id): int (*getfn)(unsigned char*, int)
*/

#include "stm32f10x.h"
#include "st_printf.h"
#include "stm32f10x_it.h"
#include "app4g.h"
#include "project_config.h"

#include <stdio.h>
#include <time.h>
#include <stdlib.h>
#include <stdio.h>

#include "transport.h"


#define INVALID_SOCKET 0xffffffff
static int mysock = INVALID_SOCKET;

int get_mqtt_transport_sock(void)
{
    return mysock;
}
#define STATE_CHECK 0
int transport_sendPacketBuffer(int sock, unsigned char* buf, int buflen)
{
//	int rc = 0;
    //rc = write(sock, buf, buflen);
    uint8_t  *cmd = at_tx_buffer;
    uint8_t *result = at_rx_buffer;
	char str_ref[20] = {0};
    int ret = -1;
    uint8_t result_len = 0;
    int i = 0;
    if(get_mqtt_transport_sock() < 0)
    {
        printf("socket have closed,mysock=%d..\r\n",mysock);
        return -1;
    }
    printf("\r\n transport_sendPacketBuffer =%d:\r\n",buflen);
#if 0
    for(i=0; i<buflen; i++)
    {
        if((i)%8 == 0)
            printf("%03d: ",i);

        printf("0x%02x,",buf[i]);
        if((i+1)%8 == 0)
            printf("\r\n");
    }
    printf("\r\n");
#endif
#if(STATE_CHECK ==1)

    result_len = 0;
    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
    snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QIACT);
    //snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
    ret = at_cmd_ack(cmd, strlen((const char*)cmd), result, &result_len,"OK", 2000);
    if (ret || !strlen((const char*)result) || !strstr((const char*)result, "OK"))
    {
        printf("%s fail,ret=%d\r\n",cmd,ret);
        return -1;
    }
#endif
    //QISEND
    result_len = 0;
    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
    //snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
    //send  data  with changeable length
    sprintf((char*)at_tx_buffer,"AT+QISEND=%d,%d\r\n",sock,buflen);
    //sprintf((char*)at_tx_buffer,"AT+QISEND=%d\r\n",sock);
    ret =at_cmd_ack(cmd, strlen((const char*)cmd),result,&result_len,">", 2000);
    //+QIOPEN: 0,0
    if (ret ==0 )
    {
        printf("ready send data...\r\n");
    }
    else
    {
        printf("%s fail,ret=%d\r\n",cmd,ret);
        return -1;
    }

    result_len = 0;
    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
    if(buflen>UART2_TX_BUFFER_LEN)
    {
        printf("uart tx buffer not engouth\r\n");
        return -1;

    }
    else
    {
        memcpy(at_tx_buffer,buf,buflen);//note******************
    }

    ret =at_cmd_ack(cmd, buflen,result,&result_len,"SEND OK", 2000);
    /*
    if (ret ==0 )
    {
        printf("send data ok...\r\n");

    }
    else
    {
        printf("%s fail,ret=%d\r\n",cmd,ret);
        return -2;
    }
    */
    printf("send data end,ret=%d,sock=%d\r\n",ret,sock);
	if(ret == 1)//"+QIURC: \"recv\",0,"
	{
		memset(str_ref,0,sizeof(str_ref));
		sprintf(str_ref,"+QIURC: \"recv\",%d,",sock);
		//if(strstr((const char*)result,"+QIURC: \"recv\",0,") != NULL)
		printf("QIURC recv check...str_ref=%s\r\n",str_ref);
		if(strstr((const char*)result,str_ref) != NULL)
		{
			result_len = 0;
			memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
			memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
			sprintf(( char*)at_tx_buffer,"AT+QIRD=%d\r\n",sock);
			ret =at_cmd_ack(cmd, strlen((const char *)cmd),result,&result_len,"+QIRD:", 2000);
			printf("at_cmd_ack ret=%d,result_len %d is:\r\n",ret,result_len);
			//is SEND OK???s
		}

	}
	memset(str_ref,0,sizeof(str_ref));
	sprintf(str_ref,"+QIURC: \"closed\",%d",sock);
	//if(strstr((const char*)result,"+QIURC: \"recv\",0,") != NULL)
	printf("QIURC closed check...str_ref=%s\r\n",str_ref);

   // if(strstr((const char*)result,"+QIURC: \"closed\",0") != NULL)
	if(strstr((const char*)result,str_ref) != NULL)
    {
        //printf("socket closed ,ret=%d rec_times=%d\r\n",ret,rec_times);
        //QISTATE

        mysock = INVALID_SOCKET;
        printf("check socket closed,mysock=%d..\r\n",mysock);
        result_len = 0;

        memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
        memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
        snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QIACT);
        //snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
        ret = at_cmd_ack(cmd, strlen((const char*)cmd), result, &result_len,"OK",2000);
        if (ret || !strlen((const char*)result) || !strstr((const char*)result, "OK"))
        {
            // snprintf(datacap, datacap_len, "4G");
            return -3;
        }

        return -4;
    }

#if(STATE_CHECK ==1)

    result_len = 0;
    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
    //snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
    //sprintf(( char*)at_tx_buffer,"AT+QISEND=0,0\r\n");
    sprintf((char*)at_tx_buffer,"AT+QISEND=%d,0\r\n",sock);
    ret =at_cmd_ack(cmd, strlen((const char *)cmd),result,&result_len,"OK", 2000);
    if (ret == 0 )
    {
        printf("check send data ok...\r\n");
    }
    else
    {
        printf("%s fail,ret=%d\r\n",cmd,ret);
        return -5;
    }
#endif
    return 0;
}


int transport_getdata(unsigned char* buf, int count)
{
#if 1
    return transport_getdatanb((void *)&mysock,buf,  count);
#else

