jsqinyunzhen/stm32_demo_rtxos/mqtt_app/transport.c
    int rc = 0;
    //rc = write(sock, buf, buflen);
    uint8_t  *cmd = at_tx_buffer;
    uint8_t *result = at_rx_buffer;
    int ret = -1;
    uint8_t result_len = 0;


    //QISTATE
    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
//	snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
    sprintf(( char*)at_tx_buffer,"AT+QIRD=0,%d",count);
    ret =at_cmd_ack(cmd, strlen((const char *)cmd),result,&result_len,"+QIRD:", 2000);
    if (ret ==0 )
    {

    }
    else
        return -1;

    //printf("received %d bytes count %d\n", rc, (int)count);
    return rc;
#endif
}


int transport_getdatanb(void *sck, unsigned char* buf, int count)
{
    int sock = *((int *)sck); 	/* sck: pointer to whatever the system may use to identify the transport */
    /* this call will return after the timeout set on initialization if no bytes;
       in your system you will use whatever you use to get whichever outstanding
       bytes your socket equivalent has ready to be extracted right now, if any,
       or return immediately */
    //int rc = 0;

    //rc = write(sock, buf, buflen);
    uint8_t  *cmd = at_tx_buffer;
    uint8_t *result = at_rx_buffer;
    int ret = -1;
    int data_len = -1;
    int bit_num;
    uint8_t result_len = 0;
    uint8_t rec_times = 0;
    int i = 0;
    uint8_t*p =NULL;
	uint8_t context_id = 0;//context_id 1----16
//[10-10-12:09:20]+QIRD: 0
//[10-10-12:09:20]
//[10-10-12:09:20]OK
	char str_ref[20] = {0x0d,0x0a,0x2b,0x51,0x49,0x52,0x44,0x3a,
						0x20,0x30,0x0d,0x0a,0x0d,0x0a,0x4f,0x4b,
						0x0d,0x0a,};
    //QISTATE
    printf("\r\n transport_getdatanb:count=%d\r\n",count);

    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
    sprintf(( char*)at_tx_buffer,"AT+QIRD=%d,%d\r\n",sock,count);
//+QIURC: "recv",0
rec:
    rec_times++;
    printf("\r\n try cmd(%s),rec_times=%d\r\n",cmd,rec_times);
    ret =at_cmd_ack(cmd, strlen((const char *)cmd),result,&result_len,"+QIRD:", 5000);
    printf("at_cmd_ack ret=%d,result_len %d is:\r\n",ret,result_len);
    /*
    set uart2 rx complete:21=AT+QIRD=0,1
    ERROR

    at_cmd_ack ret=-3,result_len 21 is:
    0x41,0x54,0x2b,0x51,0x49,0x52,0x44,0x3d,
    0x30,0x2c,0x31,0x0d,0x0d,0x0a,0x45,0x52,
    0x52,0x4f,0x52,0x0d,0x0a,
    */
    #if 0
    for(i=0; i<result_len; i++)
    {
        printf("0x%02x,",result[i]);
        if((i+1)%8 == 0)
            printf("\r\n");
    }
    printf("\r\n");
	#endif
    //if(rec_times > 30)
    if(rec_times > 5)
    {
        printf("no rec data\r\n");
        return -1;
    }
#if 0
[09-10-20:09:19]+QIURC: "recv"
    ,0
    [09-10-20:09:19]
    [09-10-20:09:19]+QIRD: 1
    [09-10-20:09:19]
    [09-10-20:09:19]
    [09-10-20:09:19]OK

    [09-11-16:35:58]+QIRD: 0
    [09-11-16:35:58]
    [09-11-16:35:58]OK
    [09-11-16:35:58]
[09-11-16:35:59]+QIURC: "recv"
    ,0


#endif
	#if 0
	if(result_len ==18)
	{
		for(i=0; i<result_len; i++)
		{
			printf("0x%02x,",result[i]);
			str_ref[i] = result[i];
			if((i+1)%8 == 0)
				printf("\r\n");
		}
		

	}
	#endif
	if(result_len ==18)
	{
		//+QIRD: 0 OK
		if(strncmp((const char*)result,str_ref,18) == 0)
		{
			printf("there is no data \r\n");
	        return -1;
		}
	}
    printf("check 1\r\n");
//[09-24-14:16:25]+QIURC: "pdpdeact",1	
#if 0
[09-24-14:16:26]set uart2 rx complete:36=
[09-24-14:16:26]+QIURC: "pdpdeact",1
[09-24-14:16:26]AT+QIRD=0,1
[09-24-14:16:26]ERROR

#endif


    if(strstr((const char*)result,"+QIURC: \"pdpdeact\",") != NULL)
    {
        printf("must execute AT+QIDEACT to deactivate the context and reset all connections\r\n");
        p = (uint8_t*)strstr((const char*)result,",");
        p += strlen(",");
        context_id = 0;
        bit_num = 0;
        while(*p != 0x0d)
        {
            context_id *= 10;
            context_id += *p - '0';

            p++;
            bit_num++;
        }
        printf("deactivate contextid is=%d(1-16)\r\n",context_id);
    }
    else 
    {
		memset(str_ref,0,sizeof(str_ref));
		sprintf(str_ref,"+QIURC: \"closed\",%d,",sock);
		//if(strstr((const char*)result,"+QIURC: \"recv\",0,") != NULL)
		printf("getdata...str_ref=%s\r\n",str_ref);

		if(strstr((const char*)result,str_ref) != NULL)
	// else if(strstr((const char*)result,"+QIURC: \"closed\",0") != NULL)
		{
		    printf("socket closed ,ret=%d rec_times=%d\r\n",ret,rec_times);
		    //QISTATE
		    result_len = 0;

		    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
		    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
		    snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN,"AT+QICLOSE=%d\r\n",sock);
		    // snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QICLOSE);
		    //snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
		    //ret = AT_cmd(cmd, strlen((const char*)cmd), result, &result_len);
		    ret =at_cmd_ack(cmd, strlen((const char *)cmd),result,&result_len,"OK", 5000);
		    printf("at_cmd_ack ret=%d,result_len %d is:\r\n",ret,result_len);
		    if (ret || !strlen((const char*)result) || !strstr((const char*)result, "OK"))
		    {
		        // snprintf(datacap, datacap_len, "4G");
		        printf("AT+QICLOSE=%d fail\r\n",sock);
		        return -2;
		    }
		    else
		    {

		        mysock = INVALID_SOCKET;
		        sock = transport_open("\"mqtt.jindoo.jopool.net\"",MQTT_PORT);
		        printf("mqtt_tcp_socket re-transport_open %d\r\n",sock);
		        if(sock < 0)
		        {
		            return -4;
		        }

		    }
		    return -3;
		}
	}
    printf("check 2\r\n");
    if(strstr((const char*)result,"+QIRD: 0") != NULL)
    {
		memset(str_ref,0,sizeof(str_ref));
		sprintf(str_ref,"+QIURC: \"recv\",%d,",sock);
		//if(strstr((const char*)result,"+QIURC: \"recv\",0,") != NULL)
		printf("getdata2...str_ref=%s\r\n",str_ref);

