jsqinyunzhen/stm32_demo_rtxos/mqtt_app/transport.c
        //p = (uint8_t*)strstr((const char*)result,"+QIURC: \"recv\",0,");
		p = (uint8_t*)strstr((const char*)result,str_ref);
        if(p != NULL)
        {
            printf("data have rec and get\r\n");
            for(i=0; i<result_len; i++)
            {
                printf("0x%02x,",result[i]);
                if((i+1)%8 == 0)
                    printf("\r\n");
            }
            printf("\r\n QIURC: recv\r\n");
            goto out;
        }
        else
        {
#if 0
            +QIRD: 0

                OK

    +QIURC: "recv"
                ,1

                rx 1  ok
    at_cmd_ack ret=0,result_len 38 is:
                               0x0d,0x0a,0x2b,0x51,0x49,0x52,0x44,0x3a,
                               0x20,0x30,0x0d,0x0a,0x0d,0x0a,0x4f,0x4b,
                               0x0d,0x0a,0x0d,0x0a,0x2b,0x51,0x49,0x55,
                               0x52,0x43,0x3a,0x20,0x22,0x72,0x65,0x63,
                               0x76,0x22,0x2c,0x31,0x0d,0x0a,

#endif
            //p = (uint8_t*)strstr((const char*)result,"+QIURC: \"recv\",0");
			//p = (uint8_t*)strstr((const char*)result,str_ref);
            //if(p != NULL)
           //     printf("data have rec ,but need  re-get\r\n");
            //else
                printf("data have not rec,send read check\r\n");
            printf("goto rec1=%d**\r\n",rec_times);
            goto rec;
        }


    }
    else
    {
        printf("$$$$$$$$$$$$$\r\n");
    }
    {
        printf("check 3\r\n");
        p = (uint8_t*)strstr((const char*)result,"+QIRD: ");
        if(p ==NULL)
        {
            printf("goto rec2=%d,result=%s**\r\n",rec_times,result);
            p = (uint8_t*)strstr((const char*)result,"ERROR");
            if(p )
            {
                p = (uint8_t*)strstr((const char*)result,"ERROR");
                printf("If the connection does not exist\r\n");
                goto out;
            }
            goto rec;
        }

        data_len = 0;
        //p += 7;
        p += strlen("+QIRD: ");
        //printf("*p=%c,*p=0x%02x,ret=%d\r\n",*p,*p,ret);
        //printf("*p=%c,*p=0x%02x,ret=%d\r\n",*(p+1),*(p+1),ret);
        //printf("*p=%c,*p=0x%02x,ret=%d\r\n",*(p+2),*(p+2),ret);
        //printf("*p=%c,*p=0x%02x,ret=%d\r\n",*(p+3),*(p+3),ret);
        data_len= 0;
        bit_num = 0;
        while(*p != 0x0d)
        {
            printf("*p=%c *p=0x%02x,ret=%d\r\n",*p,*p,ret);
            data_len *= 10;
            data_len += *p - '0';
            bit_num++;
            p++;
        }
        printf("autual data len2 is :data_len=%d bit_num=%d\r\n",data_len,bit_num);
        p+= 2;
        for(i = 0; i < data_len; i++)
        {
            buf[i] = *p++;
            //printf("buf[%d]=0x%02x \r\n",i,buf[i]);
        }
        if(count == data_len)
        {
            printf("rec end\r\n");
            goto out;
        }

    }
    printf("check 4\r\n");
	memset(str_ref,0,sizeof(str_ref));
	sprintf(str_ref,"+QIURC: \"recv\",%d,",sock);
	//if(strstr((const char*)result,"+QIURC: \"recv\",0,") != NULL)
	printf("getdata4...str_ref=%s\r\n",str_ref);

    //if(strstr((const char*)result,"+QIURC: \"recv\",0") != NULL)
	if(strstr((const char*)result,str_ref) != NULL)
    {
       // p = (uint8_t*)strstr((const char*)result,"+QIURC: \"recv\",0,");
		p = (uint8_t*)strstr((const char*)result,str_ref);
        if(p == NULL)
        {
            printf("need re-send read data\r\n");
        }
        else
        {
            printf("data have rec\r\n");
            for(i=0; i<result_len; i++)
            {
                printf("0x%02x,",result[i]);
                if((i+1)%8 == 0)
                    printf("\r\n");
            }
            printf("\r\n QIURC: recv\r\n");
        }


        goto rec;
    }


//+QIURC: "closed",0
#if 0

    p = (uint8_t*)strstr((const char*)result,"+QIRD: ");
    if(p ==NULL)
    {
        return -1;
    }
    //printf("autual data len is :p=%s\r\n",p);
    ret = 0;
    p += 7;
    while(*p != 0x0d)
    {
        printf("*p=%c *p=0x%02x,ret=%d\r\n",*p,*p,ret);
        ret *= 10;
        ret += *p - '0';

        p++;
    }
    printf("autual data len is :ret=%d\r\n",ret);
    p+= 2;

    for(i = 0; i < ret; i++)
        buf[i] = *p++;

    //ret =at_cmd_ack(cmd, strlen(cmd),result,&result_len,"+QIURC:", 2000);
    ret = 0;
    if (ret ==0 )
    {
        result_len = 0;
        //memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
        //memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
        //sprintf(( char*)at_tx_buffer,"AT+QIRD=%d,%d\r\n",sock,count);

        ret =at_cmd_ack(cmd, strlen(cmd),result,&result_len,"+QIRD:", 5000);
        if (ret ==0 )
        {
            printf("result QIRD:%d\r\n",result_len);
            memcpy(buf,result,result_len);

        }
        else
            return -1;
    }
    else
    {
        return -2;
    }
#endif

out:
    //printf("received %d bytes count %d\n", rc, (int)count);
    for(i=0; i<data_len; i++)
    {
        printf("0x%02x,",buf[i]);
        if((i+1)%8 == 0)
            printf("\r\n");
    }
    printf("\r\n transport_getdatanb %d:%d end\r\n",count,data_len);
    return data_len;



}

/**
return >=0 for a socket descriptor, <0 for an error code
@todo Basically moved from the sample without changes, should accomodate same usage for 'sock' for clarity,
removing indirections
*/
int transport_open(char* addr, int port)
{
    uint8_t  *cmd = at_tx_buffer;
    uint8_t *result = at_rx_buffer;
	char str_ref[15] = {0};
    int ret = -1;
    uint8_t result_len = 0;
    int contextid= 1;
	int connectid= 0;
    int error= 0;
    int bit_num= 0;
    //QISTATE
#if(STATE_CHECK ==1)
    result_len = 0;
    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
    snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
    //ret = AT_cmd(cmd, strlen((const char*)cmd), result, &result_len);
    ret =at_cmd_ack(cmd, strlen((const char*)cmd),result,&result_len,"OK", 3000);
    if (ret || !strlen((const char*)result) || !strstr((const char*)result, "OK"))
    {
        // snprintf(datacap, datacap_len, "4G");
        return -1;
    }
#endif
    printf("AT_QIOPEN start\r\n");





//transport_sendPacketBuffer("\"182.92.12.11\",123",buf,nbytes);

#if 1
    //AT+QIOPEN=1,2,"UDP SERVICE","127.0.0.1",0,3030,0
open:
    result_len = 0;
    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
    //snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
    if(port == NTP_PORT)
    {
        //snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN,"AT+QIOPEN=1,0,\"UDP\",%s,%d,0,0\r\n",addr,  port);
        //connectid =1;
        contextid = NTP_UDP_CONTEXT_ID;
        connectid = NTP_UDP_CONNECT_ID;
        snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN,"AT+QIOPEN=%d,%d,\"UDP\",%s,%d,0,0\r\n",contextid,connectid,addr,  port);
    }
    else if(port == MQTT_PORT)
		{
        //snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QIOPEN);
        contextid = MQTT_TCP_CONTEXT_ID;
        connectid = MQTT_TCP_CONNECT_ID;
        snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN,"AT+QIOPEN=%d,%d,\"TCP\",%s,%d,0,0\r\n",contextid,connectid,addr,  port);
		}
    else
    {
        printf("invalid port=%d\r\n",port);
        return -1;
    }
    printf("cmd=%s\r\n",cmd);
#else
    char connect_server_ip_port_cmd[56];
    memset(connect_server_ip_port_cmd,'\0',56);
    strcpy(connect_server_ip_port_cmd,"AT+QIOPEN=1,0,\"UDP\",");
    //strcpy(connect_server_ip_port_cmd,"AT+QIOPEN=1,0,\"TCP\",");
    //strcat(connect_server_ip_port_cmd,server_ip_and_port);
    strcat(connect_server_ip_port_cmd,addr, port);
    strcat(connect_server_ip_port_cmd,",0,0\r\n");
#endif
    ret =at_cmd_ack(cmd, strlen((const char*)cmd),result,&result_len,"+QIOPEN:", 7000);
    //+QIOPEN: 0,0
    if (ret ==0 )
    {
        char i = 0;
        //+QIOPEN: 0,561 result_len=24 strlen(pstr)=9
        //get connectid
        printf("result=%s result_len=%d\r\n",result,result_len);
        char* pstr= strstr((const char*)result, ":");
        printf("pstr=%s strlen(pstr)=%d\r\n",pstr,strlen(pstr));
        for(i=0; i<strlen(pstr); i++)
            printf("(*%d:%c=0x%02x*), ",i,*(pstr+i),*(pstr+i));
        printf("\r\n");

        connectid= *(pstr+2)-'0';
        //get error
        //pstr= strstr((const char*)result, ",");
        //connectid=0 error=178004728
        
