jsqinyunzhen/stm32_demo_rtxos/mqtt_app/transport.c
       // pstr= strstr((const char*)result, "+QIOPEN: 0,");
		sprintf(str_ref,"+QIOPEN: %d,",connectid);
		pstr= strstr((const char*)result, str_ref);
        printf("str_ref=%s  pstr=%s strlen(pstr)=%d\r\n",str_ref,pstr,strlen(pstr));
        for(i=0; i<strlen(pstr); i++)
            printf("(*%d:%c=0x%02x*), ",i,*(pstr+i),*(pstr+i));

        printf("\r\n");
#if 1
        //pstr += strlen("+QIOPEN: 0,");
		pstr += strlen(str_ref);
        error = 0;
        bit_num = 0;
        while(*pstr != 0x0d)
        {
            error *= 10;
            error += *pstr - '0';

            pstr++;
            bit_num++;
        }

#else
        if(strlen(pstr) ==6)
        {
            error= *(pstr+1)-'0';
            error *= 10;

            error += *(pstr+2)-'0';
            error *= 10;

            error += *(pstr+3)-'0';
        }
        else
            error= *(pstr+1)-'0';
#endif
        //error= *(pstr+4)-'0';
        printf("connectid=%d error=%d bit_num=%d\r\n",connectid,error,bit_num);
        if(error == 561)
        {
            //connectid ++;
            //Open PDP context failed
            //goto open;
            return -2;
        }
        if(error == 563)
        {
            connectid ++;
            //563  Socket identity has been used
            goto open;
        }

        else if(error != 0)
            return -2;

		if(connectid != MQTT_TCP_CONNECT_ID )
			printf("####MQTT_TCP_CONNECT_ID != connectid= %d\r\n",connectid);
        mysock = connectid;
		
    }
    else
    {
        printf("QIOPEN FAIL %d\r\n",ret);
        return -3;
    }
#if(STATE_CHECK ==1)

    printf("QISTATE start\r\n");
    //QISTATE
    result_len = 0;

    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
    snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
    //snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
    ret = AT_cmd(cmd, strlen((const char*)cmd), result, &result_len);
    if (ret || !strlen((const char*)result) || !strstr((const char*)result, "OK"))
    {
        // snprintf(datacap, datacap_len, "4G");
        return -4;
    }
#endif

    return mysock;
}


int transport_close(int sock)
{
    uint8_t  *cmd = at_tx_buffer;
    uint8_t *result = at_rx_buffer;
    int ret = -1;
    uint8_t result_len = 0;
    int connectid= sock;

    result_len = 0;

    //AT_QICLOSE
    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
    snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, "AT+QICLOSE=%d\r\n",connectid);
    printf("at_tx_buffer=%s\r\n",at_tx_buffer);
    ret = AT_cmd(cmd, strlen((const char*)cmd), result, &result_len);
    if (ret || !strlen((const char*)result) || !strstr((const char*)result, "OK"))
    {
        // snprintf(datacap, datacap_len, "4G");
        return -1;
    }

    result_len = 0;
    //QISTATE
    memset(at_tx_buffer,0,UART2_TX_BUFFER_LEN);
    memset(at_rx_buffer,0,UART2_RX_BUFFER_LEN);
    snprintf(( char*)at_tx_buffer,UART2_TX_BUFFER_LEN, AT_QISTATE);
    ret = AT_cmd(cmd, strlen((const char*)cmd), result, &result_len);
    if (ret || !strlen((const char*)result) || !strstr((const char*)result, "OK"))
    {
        // snprintf(datacap, datacap_len, "4G");
        return -1;
    }
    return 0;
}

// 短整型大小端互换

#define BigLittleSwap16(A)  ((((uint16_t)(A) & 0xff00) >> 8) | (((uint16_t)(A) & 0x00ff) << 8))

// 长整型大小端互换

#define BigLittleSwap32(A)  ( (((uint32_t)(A)&0xff000000) >> 24) | (((uint32_t)(A)&0x00ff0000) >> 8) |(((uint32_t)(A)&0x0000ff00) << 8)|(((uint32_t)(A)&0x000000ff) << 24))

// 本机大端返回1，小端返回0

int checkCPUendian()

{

    union {

        unsigned long int i;

        unsigned char s[4];

    } c;



    c.i = 0x12345678;
//--1--BIG , 0 LITTLE
    return (0x12 == c.s[0]);

}

// 模拟htonl函数，本机字节序转网络字节序

unsigned long int htonl(unsigned long int h)

{

    // 若本机为大端，与网络字节序同，直接返回

    // 若本机为小端，转换成大端再返回

    return checkCPUendian() ? h : BigLittleSwap32(h);

}

// 模拟ntohl函数，网络字节序转本机字节序

unsigned long int ntohl(unsigned long int n)

{

    // 若本机为大端，与网络字节序同，直接返回

    // 若本机为小端，网络数据转换成小端再返回

    return checkCPUendian() ? n : BigLittleSwap32(n);

}

// 模拟htons函数，本机字节序转网络字节序

unsigned short int htons(unsigned short int h)

{

    // 若本机为大端，与网络字节序同，直接返回

    // 若本机为小端，转换成大端再返回

    return checkCPUendian() ? h : BigLittleSwap16(h);

}

// 模拟ntohs函数，网络字节序转本机字节序

unsigned short int ntohs(unsigned short int n)

{

    // 若本机为大端，与网络字节序同，直接返回

    // 若本机为小端，网络数据转换成小端再返回

    return checkCPUendian() ? n : BigLittleSwap16(n);

}



#define VERSION_3           3
#define VERSION_4           4

#define MODE_CLIENT         3
#define MODE_SERVER         4


#define NTP_LI              0
#define NTP_VN              VERSION_3
#define NTP_MODE            MODE_CLIENT
#define NTP_STRATUM         0
#define NTP_POLL            4
#define NTP_PRECISION       -6

#define NTP_HLEN            48

#define NTP_PORT            123
#define NTP_SERVER          "182.92.12.11"

#define TIMEOUT             10

#define BUFSIZE            100// 1500

#define JAN_1970            0x83aa7e80

#define NTP_CONV_FRAC32(x)  (uint64_t) ((x) * ((uint64_t)1<<32))
#define NTP_REVE_FRAC32(x)  ((double) ((double) (x) / ((uint64_t)1<<32)))

#define NTP_CONV_FRAC16(x)  (uint32_t) ((x) * ((uint32_t)1<<16))
#define NTP_REVE_FRAC16(x)  ((double)((double) (x) / ((uint32_t)1<<16)))


#define USEC2FRAC(x)        ((uint32_t) NTP_CONV_FRAC32( (x) / 1000000.0 ))
#define FRAC2USEC(x)        ((uint32_t) NTP_REVE_FRAC32( (x) * 1000000.0 ))


#define NTP_LFIXED2DOUBLE(x)    ((double) ( ntohl(((struct l_fixedpt *) (x))->intpart) - JAN_1970 + FRAC2USEC(ntohl(((struct l_fixedpt *) (x))->fracpart)) / 1000000.0 ))


struct s_fixedpt {
    uint16_t    intpart;
    uint16_t    fracpart;
};

