jsqinyunzhen/stm32_demo_rtxos/mqtt_app/transport.c
struct l_fixedpt {
    uint32_t    intpart;
    uint32_t    fracpart;
};


struct ntphdr {
#if 0//__BYTE_ORDER == __BID_ENDIAN
    unsigned int    ntp_li:2;
    unsigned int    ntp_vn:3;
    unsigned int    ntp_mode:3;
#endif
//#if __BYTE_ORDER == __LITTLE_ENDIAN
    unsigned int    ntp_mode:3;
    unsigned int    ntp_vn:3;
    unsigned int    ntp_li:2;
//#endif
    uint8_t         ntp_stratum;
    uint8_t         ntp_poll;
    int8_t          ntp_precision;
    struct s_fixedpt    ntp_rtdelay;
    struct s_fixedpt    ntp_rtdispersion;
    uint32_t            ntp_refid;
    struct l_fixedpt    ntp_refts;
    struct l_fixedpt    ntp_orits;
    struct l_fixedpt    ntp_recvts;
    struct l_fixedpt    ntp_transts;
};


struct timeval {
    time_t tv_sec; // seconds
    long tv_usec; // microseconds
};
int get_ntp_packet(void *buf, size_t *size)
{
    struct ntphdr *ntp;
    struct timeval tv= {0};


    if (!size || *size<NTP_HLEN)
        return -1;

    memset(buf, 0, *size);

    ntp = (struct ntphdr *) buf;
    ntp->ntp_li = NTP_LI;
    ntp->ntp_vn = NTP_VN;
    ntp->ntp_mode = NTP_MODE;
    ntp->ntp_stratum = NTP_STRATUM;
    ntp->ntp_poll = NTP_POLL;
    ntp->ntp_precision = NTP_PRECISION;

    //gettimeofday(&tv, NULL);
    printf("tv.tv_sec:%d\r\n",tv.tv_sec);
    printf("tv.tv_usec:%d\r\n",tv.tv_usec);

    ntp->ntp_transts.intpart = htonl(tv.tv_sec + JAN_1970);
    ntp->ntp_transts.fracpart = htonl(USEC2FRAC(tv.tv_usec));

    *size = NTP_HLEN;

    return 0;
}


void print_ntp(struct ntphdr *ntp)
{
    time_t time;

    printf("LI:\t%d \r\n", ntp->ntp_li);
    printf("VN:\t%d \r\n", ntp->ntp_vn);
    printf("Mode:\t%d \r\n", ntp->ntp_mode);
    printf("Stratum:\t%d \r\n", ntp->ntp_stratum);
    printf("Poll:\t%d \r\n", ntp->ntp_poll);
    printf("precision:\t%d \r\n", ntp->ntp_precision);

    printf("Route delay:\t %lf \r\n",
           ntohs(ntp->ntp_rtdelay.intpart) + NTP_REVE_FRAC16(ntohs(ntp->ntp_rtdelay.fracpart)));
    printf("Route Dispersion:\t%lf \r\n",
           ntohs(ntp->ntp_rtdispersion.intpart) + NTP_REVE_FRAC16(ntohs(ntp->ntp_rtdispersion.fracpart)));
    printf("Referencd ID:\t %d \r\n", ntohl(ntp->ntp_refid));


    time = ntohl(ntp->ntp_refts.intpart) - JAN_1970;
    printf("Reference:\t%d %ld %s \r\n",
           ntohl(ntp->ntp_refts.intpart) - JAN_1970,
           FRAC2USEC(ntohl(ntp->ntp_refts.fracpart)),
           ctime(&time));

    time = ntohl(ntp->ntp_orits.intpart) - JAN_1970;
    printf("Originate:\t%d %d frac=%ld (%s) \r\n",
           ntohl(ntp->ntp_orits.intpart) - JAN_1970,
           FRAC2USEC(ntohl(ntp->ntp_orits.fracpart)),
           ntohl(ntp->ntp_orits.fracpart),
           ctime(&time) );

    time = ntohl(ntp->ntp_recvts.intpart) - JAN_1970;
    printf("Receive:\t%d %d (%s) \r\n",
           ntohl(ntp->ntp_recvts.intpart) - JAN_1970,
           FRAC2USEC(ntohl(ntp->ntp_recvts.fracpart)),
           ctime(&time) );

    time = ntohl(ntp->ntp_transts.intpart) - JAN_1970;
    printf("Transmit:\t%d %d (%s) \r\n",
           ntohl(ntp->ntp_transts.intpart) - JAN_1970,
           FRAC2USEC(ntohl(ntp->ntp_transts.fracpart)),
           ctime(&time) );
}

#if 1
double get_rrt(const struct ntphdr *ntp, const struct timeval *recvtv)
{
    double t1, t2, t3, t4;

    t1 = NTP_LFIXED2DOUBLE(&ntp->ntp_orits);
    t2 = NTP_LFIXED2DOUBLE(&ntp->ntp_recvts);
    t3 = NTP_LFIXED2DOUBLE(&ntp->ntp_transts);
    t4 = recvtv->tv_sec + recvtv->tv_usec / 1000000.0;

    return (t4 - t1) - (t3 - t2);
}

double get_offset(const struct ntphdr *ntp, const struct timeval *recvtv)
{
    double t1, t2, t3, t4;

    t1 = NTP_LFIXED2DOUBLE(&ntp->ntp_orits);
    t2 = NTP_LFIXED2DOUBLE(&ntp->ntp_recvts);
    t3 = NTP_LFIXED2DOUBLE(&ntp->ntp_transts);
    t4 = recvtv->tv_sec + recvtv->tv_usec / 1000000.0;

    return ((t2 - t1) + (t3 - t4)) / 2;
}
#endif



int at_udp_ntp_test(void)
{
    int sock = 0;
    size_t nbytes;
    unsigned char buf[BUFSIZE]= {0};
    char i =0;
    int ret = -1;

    sock  = transport_open("\"182.92.12.11\"",NTP_PORT);
    nbytes = BUFSIZE;
    if (get_ntp_packet(buf, &nbytes) != 0)
    {
        printf("construct ntp request error \r\n");

    }
    printf("get_ntp_packet:%d\r\n",nbytes);
    for(i=0; i<nbytes; i++)
        printf("buf[%d]=0x%x,",i,buf[i]);
    printf("get_ntp_packet:\r\n");
    ret = transport_sendPacketBuffer(sock,buf,nbytes);
    printf("transport_sendPacketBuffer ret=%d\r\n",ret);

    memset(buf,0,sizeof(buf));
    ret = transport_getdatanb(&sock,buf,BUFSIZE);
    printf("transport_getdatanb:%d\r\n",ret);
    if(ret >0)
    {
        for(i=0; i<ret; i++)
        {
            printf("buf[%02d]=0x%02x,",i,buf[i]);
            if((i+1)%8 == 0)
                printf("\r\n");
        }
        printf("\r\ntransport_getdatanb:\r\n");
    }
    print_ntp((struct ntphdr *)buf);

    //struct timeval recvtv;
//	double offset;
//	offset = get_offset((struct ntphdr *)buf, &recvtv);

    //获取NTP服务器返回的时间
//#define USEC(x) (((x) >> 12) - 759 * ((((x) >> 10) + 32768) >> 16))

    struct ntphdr *pbuf=(struct ntphdr *)buf;

//	recvtv.tv_sec	= pbuf->ntp_transts.intpart - JAN_1970;
//	recvtv.tv_usec	= USEC(pbuf->ntp_transts.fracpart);

    time_t time;
    time = ntohl(pbuf->ntp_transts.intpart) - JAN_1970;


    printf("获取NTP服务器返回的时间 %s\r\n",ctime(&time) );
    struct tm *tm_now;



    tm_now = localtime(&time);
    printf("cur tm_now =%d-%d-%d %d:%d:%d \r\n",       \
           tm_now->tm_year+1900, tm_now->tm_mon, tm_now->tm_mday,  \
           tm_now->tm_hour, tm_now->tm_min, tm_now->tm_sec);


    transport_close(sock );

    return 0;
}

int at_tcp_mqtt_test(void)
{
    int sock = 0;
    size_t nbytes;
//	unsigned char buf[BUFSIZE]= {0};
    char i =0;
    int ret = -1;

    sock  = transport_open("\"mqtt.fluux.io\"",1883);

    //nbytes = BUFSIZE;
#if 0
    [09-10-18:34:24]0x10,0x26,0x00,0x04,0x4d,0x51,0x54,0x54,
    [09-10-18:34:24]0x04,0xc2,0x00,0x14,0x00,0x02,0x6d,0x65,
    [09-10-18:34:24]0x00,0x08,0x74,0x65,0x73,0x74,0x75,0x73,
    [09-10-18:34:24]0x65,0x72,0x00,0x0c,0x74,0x65,0x73,0x74,
    [09-10-18:34:24]0x70,0x61,0x73,0x73,0x77,0x6f,0x72,0x64,


    [09-10-18:47:27]0x10,0x26,0x00,0x04,0x4d,0x51,0x54,0x54,
    [09-10-18:47:27]0x04,0xc2,0x00,0x14,0x00,0x02,0x6d,0x65,
    [09-10-18:47:27]0x00,0x08,0x74,0x65,0x73,0x74,0x75,0x73,
    [09-10-18:47:27]0x65,0x72,0x00,0x0c,0x74,0x65,0x73,0x74,
    [09-10-18:47:27]0x70,0x61,0x73,0x73,0x77,0x6f,0x72,0x64,

#endif
    unsigned char buf[]= {0x10,0x26,0x00,0x04,0x4d,0x51,0x54,0x54,
                          0x04,0xc2,0x00,0x14,0x00,0x02,0x6d,0x65,
                          0x00,0x08,0x74,0x65,0x73,0x74,0x75,0x73,
                          0x65,0x72,0x00,0x0c,0x74,0x65,0x73,0x74,
                          0x70,0x61,0x73,0x73,0x77,0x6f,0x72,0x64
                         };
    nbytes = sizeof( buf);

    ret = transport_sendPacketBuffer(sock,buf,nbytes);
    printf("transport_sendPacketBuffer ret=%d\r\n",ret);

    memset(buf,0,sizeof(buf));
    //connack
    ret = transport_getdatanb(&sock,buf,4);
    printf("transport_getdatanb:%d\r\n",ret);
    if(ret >0)
    {
        for(i=0; i<ret; i++)
        {
            printf("buf[%02d]=0x%02x,",i,buf[i]);
            if((i+1)%8 == 0)
                printf("\r\n");
        }
        printf("\r\ntransport_getdatanb:\r\n");
    }


    transport_close(sock );

    return 0;
}

